apache/nuttx/boards/mips/pic32mx/pic32mx7mmb/src/pic32_touchscreen.c
struct tc_dev_s
{
#ifdef CONFIG_TOUCHSCREEN_REFCNT
  uint8_t crefs;                       /* Number of times the device has been opened */
#endif
  uint8_t state;                       /* See enum tc_state_e */
  uint8_t nwaiters;                    /* Number of threads waiting for touchscreen data */
  uint8_t id;                          /* Current touch point ID */
  volatile bool penchange;             /* An unreported event is buffered */
  uint16_t value;                      /* Partial sample value (Y+ or X-) */
  uint16_t newy;                       /* New, un-thresholded Y value */
  mutex_t devlock;                     /* Manages exclusive access to this structure */
  sem_t waitsem;                       /* Used to wait for the availability of data */
  struct tc_sample_s sample;           /* Last sampled touch point data */
  struct work_s work;                  /* Supports the state machine delayed processing */

  /* The following is a list if poll structures of threads waiting for
   * driver events. The 'struct pollfd' reference for each open is also
   * retained in the f_priv field of the 'struct file'.
   */

  struct pollfd *fds[CONFIG_TOUCHSCREEN_NPOLLWAITERS];
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static void tc_adc_sample(int pin);
static uint16_t tc_adc_convert(void);
static void tc_yminus_sample(void);
static void tc_yplus_sample(void);
static void tc_xplus_sample(void);
static void tc_xminus_sample(void);
static inline bool tc_valid_sample(uint16_t sample);

static void tc_notify(struct tc_dev_s *priv);
static int tc_sample(struct tc_dev_s *priv,
                     struct tc_sample_s *sample);
static int tc_waitsample(struct tc_dev_s *priv,
                         struct tc_sample_s *sample);
static void tc_worker(void *arg);

/* Character driver methods */

static int tc_open(struct file *filep);
static int tc_close(struct file *filep);
static ssize_t tc_read(struct file *filep, char *buffer, size_t len);
static int tc_ioctl(struct file *filep, int cmd, unsigned long arg);
static int tc_poll(struct file *filep, struct pollfd *fds, bool setup);

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* This the vtable that supports the character driver interface */

static const struct file_operations g_tc_fops =
{
  tc_open,    /* open */
  tc_close,   /* close */
  tc_read,    /* read */
  NULL,       /* write */
  NULL,       /* seek */
  tc_ioctl,   /* ioctl */
  NULL,       /* mmap */
  NULL,       /* truncate */
  tc_poll     /* poll */
};

/* If only a single touchscreen device is supported, then the driver state
 * structure may as well be pre-allocated.
 */

#ifndef CONFIG_TOUCHSCREEN_MULTIPLE
static struct tc_dev_s g_touchscreen;
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: tc_adc_sample
 *
 * Description:
 *   Perform A/D sampling.
 *   Time must be allowed between the start of sampling
 *   and conversion (approx. 100Ms).
 *
 ****************************************************************************/

static void tc_adc_sample(int pin)
{
  /* Configure the pins for as an analog input. AD1PCFG specifies the
   * configuration of device pins to be used as analog inputs. A pin
   * is configured as an analog input when the corresponding PCFGn bit
   * is 0.
   */

  putreg32(ADC_CFG(pin), PIC32MX_ADC_CFGCLR);

  /* Set SAMP=0, format 16-bit unsigned integer, manual conversion,
   * SAMP=1 will trigger.
   */

  putreg32(0, PIC32MX_ADC_CON1);

  /* Select the pin as the MUXA CH0 input (positive) */

  putreg32(ADC_CHS_CH0SA(pin), PIC32MX_ADC_CHS);

  /* No input scan */

  putreg32(0, PIC32MX_ADC_CSSL);

  /* Manual sample, TAD = internal, 6 TPB */

  putreg32(ADC_CON3_ADCS(6) | ADC_CON3_SAMC(0), PIC32MX_ADC_CON3);

  /* No interrupts, no scan, internal voltage reference */

  putreg32(ADC_CON2_VCFG_AVDDAVSS, PIC32MX_ADC_CON2);

  /* Turn on the ADC */

  putreg32(ADC_CON1_ON, PIC32MX_ADC_CON1SET);

  /* Start sampling */

  putreg32(ADC_CON1_SAMP, PIC32MX_ADC_CON1SET);
}

/****************************************************************************
 * Name: tc_adc_convert
 *
 * Description:
 *   Begin A/D conversion.
 *   Time must be allowed between the start of sampling
 *   and conversion (approx. 100Ms).
 *
 * Assumptions:
 * 1) All output pins configured as outputs:
 * 2) Appropriate pins are driven high and low
 *
 ****************************************************************************/

static uint16_t tc_adc_convert(void)
{
  uint32_t retval;

  /* Start conversion */

  putreg32(ADC_CON1_SAMP, PIC32MX_ADC_CON1CLR);

  /* Wait for the conversion to complete */

  while ((getreg32(PIC32MX_ADC_CON1) & ADC_CON1_DONE) == 0);

  /* Then read the converted ADC value */

  retval = getreg32(PIC32MX_ADC_BUF0);

  /* Disable the ADC */

  putreg32(ADC_CON1_ON, PIC32MX_ADC_CON1CLR);

  /* Reset all pins to digital function */

  putreg32(LCD_ALL_BITS, PIC32MX_ADC_CFGSET);
  return (uint16_t)retval;
}

/****************************************************************************
 * Name: tc_yminus_sample
 *
 * Description:
 *   Initiate sampling on Y-
 *
 ****************************************************************************/

static void tc_yminus_sample(void)
{
  /* Configure X- as an input and X+, Y+, and Y- as outputs */

  putreg32(LCD_XPLUS_BIT | LCD_YPLUS_BIT | LCD_YMINUS_BIT,
           PIC32MX_IOPORTB_TRISCLR);
  putreg32(LCD_XMINUS_BIT, PIC32MX_IOPORTB_TRISSET);

  /* Energize the X plate: Y+ and Y- high, X+ low */

  putreg32(LCD_XPLUS_BIT, PIC32MX_IOPORTB_PORTCLR);
  putreg32(LCD_YPLUS_BIT | LCD_YMINUS_BIT, PIC32MX_IOPORTB_PORTSET);

