apache/nuttx/boards/mips/pic32mx/pic32mx7mmb/src/pic32_touchscreen.c
  /* Start the Y axis sampling */

  tc_adc_sample(LCD_XMINUS_PIN);
}

/****************************************************************************
 * Name: tc_yplus_sample
 *
 * Description:
 *   Initiate sampling on Y+
 *
 ****************************************************************************/

static void tc_yplus_sample(void)
{
  /* Configure X+ as an input and X-, Y+, and Y- as outputs */

  putreg32(LCD_XMINUS_BIT | LCD_YPLUS_BIT | LCD_YMINUS_BIT,
           PIC32MX_IOPORTB_TRISCLR);
  putreg32(LCD_XPLUS_BIT, PIC32MX_IOPORTB_TRISSET);

  /* Energize the X plate: Y+ and Y- High, X- low (X+ is an input) */

  putreg32(LCD_XMINUS_BIT, PIC32MX_IOPORTB_PORTCLR);
  putreg32(LCD_YPLUS_BIT | LCD_YMINUS_BIT, PIC32MX_IOPORTB_PORTSET);

  /* Start the Y axis sampling */

  tc_adc_sample(LCD_XPLUS_PIN);
}

/****************************************************************************
 * Name: tc_xplus_sample
 *
 * Description:
 *   Initiate sampling on X+
 *
 ****************************************************************************/

static void tc_xplus_sample(void)
{
  /* Configure Y+ as an input and X+, X-, and Y- as outputs */

  putreg32(LCD_XPLUS_BIT | LCD_XMINUS_BIT | LCD_YMINUS_BIT,
           PIC32MX_IOPORTB_TRISCLR);
  putreg32(LCD_YPLUS_BIT, PIC32MX_IOPORTB_TRISSET);

  /* Energize the Y plate: X+ and X- high, Y- low (Y+ is an input) */

  putreg32(LCD_YMINUS_BIT, PIC32MX_IOPORTB_PORTCLR);
  putreg32(LCD_XPLUS_BIT | LCD_XMINUS_BIT, PIC32MX_IOPORTB_PORTSET);

  /* Read the X axis value */

  tc_adc_sample(LCD_YPLUS_PIN);
}

/****************************************************************************
 * Name: tc_xminus_sample
 *
 * Description:
 *   Initiate sampling on X-
 *
 ****************************************************************************/

static void tc_xminus_sample(void)
{
  /* Configure Y- as an input and X+, Y+, and X- as outputs */

  putreg32(LCD_XPLUS_BIT | LCD_XMINUS_BIT | LCD_YPLUS_BIT,
           PIC32MX_IOPORTB_TRISCLR);
  putreg32(LCD_YMINUS_BIT, PIC32MX_IOPORTB_TRISSET);

  /* Energize the Y plate: X+ and X- high, Y+ low (Y- is an input) */

  putreg32(LCD_YPLUS_BIT, PIC32MX_IOPORTB_PORTCLR);
  putreg32(LCD_XPLUS_BIT | LCD_XMINUS_BIT, PIC32MX_IOPORTB_PORTSET);

  /* Start X axis sampling */

  tc_adc_sample(LCD_YMINUS_PIN);
}

/****************************************************************************
 * Name: tc_valid_sample
 ****************************************************************************/

static inline bool tc_valid_sample(uint16_t sample)
{
  return (sample > LOWER_THRESHOLD /* && sample < UPPER_THRESHOLD */);
}

/****************************************************************************
 * Name: tc_notify
 ****************************************************************************/

static void tc_notify(struct tc_dev_s *priv)
{
  /* If there are threads waiting on poll() for touchscreen data to become
   * available, then wake them up now.  NOTE: we wake up all waiting threads
   * because we do not know that they are going to do.
   * If they all try to read the data, then some make end up blocking after
   * all.
   */

  poll_notify(priv->fds, CONFIG_TOUCHSCREEN_NPOLLWAITERS, POLLIN);

  /* If there are threads waiting for read data, then signal one of them
   * that the read data is available.
   */

  if (priv->nwaiters > 0)
    {
      /* After posting this semaphore, we need to exit because the
       * touchscreen is no longer available.
       */

      nxsem_post(&priv->waitsem);
    }
}

/****************************************************************************
 * Name: tc_sample
 *
 * Assumptions:  pre-emption is disabled
 *
 ****************************************************************************/

static int tc_sample(struct tc_dev_s *priv,
                          struct tc_sample_s *sample)
{
  int ret = -EAGAIN;

  /* Is there new touchscreen sample data available? */

  if (priv->penchange)
    {
      /* Yes.. the state has changed in some way.  Return a copy of the
       * sampled data.
       */

      memcpy(sample, &priv->sample, sizeof(struct tc_sample_s));

      /* Now manage state transitions */

      if (sample->contact == CONTACT_UP)
        {
          /* Next.. no contact.  Increment the ID so that next contact ID
           * will be unique.  X/Y positions are no longer valid.
           */

          priv->sample.contact = CONTACT_NONE;
          priv->sample.valid   = false;
          priv->id++;
        }
      else if (sample->contact == CONTACT_DOWN)
        {
          /* First report -- next report will be a movement */

          priv->sample.contact = CONTACT_MOVE;
        }

      priv->penchange = false;
      ret = OK;
    }

  return ret;
}

/****************************************************************************
 * Name: tc_waitsample
 ****************************************************************************/

static int tc_waitsample(struct tc_dev_s *priv,
                              struct tc_sample_s *sample)
{
  int ret;

  /* Interrupts must be disabled when this is called to (1) prevent posting
   * of semaphores from interrupt handlers, and (2) to prevent sampled data
   * from changing until it has been reported.
   */

  flags = enter_critical_section();

  /* Now release the mutex that manages mutually exclusive access to
   * the device structure.  This may cause other tasks to become ready to
   * run, but they cannot run yet because pre-emption is disabled.
   */

  nxmutex_unlock(&priv->devlock);

  /* Try to get the a sample... if we cannot, then wait on the semaphore
   * that is posted when new sample data is available.
   */

  while (tc_sample(priv, sample) < 0)
    {
      /* Wait for a change in the touchscreen state */

      priv->nwaiters++;
      ret = nxsem_wait(&priv->waitsem);
      priv->nwaiters--;

      if (ret < 0)
        {
          goto errout;
        }
    }

  /* Re-acquire the mutex that manages mutually exclusive access to
   * the device structure. We may have to wait here. But we have our sample.
   * Interrupts and pre-emption will be re-enabled while we wait.
   */

